"use strict";

// let x = 5; alert( x++ ); // сначала выводит 5, а потом меняет результат

// [ ] + false - null + true
// console.log([] + false - null + true); // пустой массив в данном случае - это пустая строка

// let y = 1; 
// let x = y = 2; // справа налево: сначала y = 2, потом x = y
// alert(x);

// console.log([ ] + 1 + 2); // "12" (пустой массив = пустая строка)

// alert( "1"[0] );

// console.log(2 && 1 && null && 0 && undefined); // оператор "и" запинается на ложном выражении и возвращает его
// И запинается на лжи
// ИЛИ запинается на правде

// console.log(!!( 1 && 2 ) === (1 && 2)); // не равны, потому что !! превращают выражение в булиновое
           // 3
// alert( null || 2 && 3 || 4 );

// const a = [1, 2, 3]; 
// const b = [1, 2, 3];

// console.log(a == b);

// alert( +"Infinity" );

// console.log("Ёжик" > "яблоко");

// console.log(0 || "" || 2 || undefined || true || falsе); // запинается на правде - выводит 2 как первую правду